Extensions/УВМ/Documents/Увольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Увольнение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_КатегорияПричиныУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_КатегорииПричинУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ФактическаяПричинаУвольнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/УВМ/Documents/Увольнение/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура УВМ_ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.Увольнение.ПровестиПоУчетам(Ссылка, РежимПроведения, Отказ, Неопределено, Движения, ЭтотОбъект, ДополнительныеСвойства);
	
	#Вставка
	//++dar 20221128 (11805)
	Если НЕ Отказ Тогда
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("ИТ");
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Сотрудник);	
	КонецЕсли;
	//--dar 20221128 (11805)
	
	//++dar 07.06.23 (117669)
	Если НЕ Отказ Тогда
		ВАрхиве = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ВАрхиве");
		Если НЕ ВАрхиве Тогда
			КадровыйУчет.ПоместитьСотрудникаВАрхив(Сотрудник);	
		КонецЕсли;
	КонецЕсли;
	//--dar 07.06.23 (117669)
	
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		Если ЗначениеЗаполнено(УВМ_Руководитель) Тогда
			МассивПодчиненных = УВМ_ОбщиеДоработки.ПодчиненныеСотрудника(ФизическоеЛицо);
			
			ТаблицаДвижений = Новый ТаблицаЗначений;
			ТаблицаДвижений.Колонки.Добавить("Период");
			ТаблицаДвижений.Колонки.Добавить("Физлицо");
			ТаблицаДвижений.Колонки.Добавить("Руководитель");
			ТаблицаДвижений.Колонки.Добавить("КадровыйДокумент");
			
			Для Каждого ТекущийПодчиненный Из МассивПодчиненных Цикл
				НовДвижение = ТаблицаДвижений.Добавить();
				НовДвижение.Период = ДатаУвольнения;
				НовДвижение.Физлицо = ТекущийПодчиненный;
				НовДвижение.Руководитель = УВМ_Руководитель;
				НовДвижение.КадровыйДокумент = Ссылка;
			КонецЦикла;
			
			УВМ_ОбщиеДоработки.СформироватьДвиженияПоРуководителям(ТаблицаДвижений);
		КонецЕсли;
	КонецЕсли;
	//--dar 25.06.25 (255715)
	#КонецВставки
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура УВМ_ОбработкаУдаленияПроведения(Отказ)
	
	//++dar 07.06.23 (117669)
	Если НЕ Отказ Тогда
		ВАрхиве = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ВАрхиве");
		Если ВАрхиве Тогда
			КадровыйУчет.ИзвлечьСотрудникаИзАрхива(Сотрудник);	
		КонецЕсли;
	КонецЕсли;
	//--dar 07.06.23 (117669)
	
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		УВМ_ОбщиеДоработки.УдалитьДвиженияПоРуководителям(Ссылка);
	КонецЕсли;	
	//--dar 25.06.25 (255715)

КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура УВМ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() 
		И УВМ_ОбщиеДоработки.ЕстьПодчиненные(ФизическоеЛицо)
		И НЕ ЗначениеЗаполнено(УВМ_Руководитель) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("У сотрудника %1 есть подчиненные. Нужно указать его ИО.", ФизическоеЛицо), , "УВМ_Руководитель", "Объект", Отказ); 
	КонецЕсли;
	//--dar 25.06.25 (255715)
КонецПроцедуры
